CSI API ETABS v1
cDatabaseTables.GetLoadCasesSelectedForDisplay Method
 Returns a list of load cases that are selected for table display.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadCasesSelectedForDisplay(
	ref int NumberSelectedLoadCases,
	ref string[] LoadCaseList
)
Function GetLoadCasesSelectedForDisplay (
	ByRef NumberSelectedLoadCases As Integer,
	ByRef LoadCaseList As String()
) As Integer
Dim instance As cDatabaseTables
Dim NumberSelectedLoadCases As Integer
Dim LoadCaseList As String()
Dim returnValue As Integer
returnValue = instance.GetLoadCasesSelectedForDisplay(NumberSelectedLoadCases,
	LoadCaseList)
int GetLoadCasesSelectedForDisplay(
	int% NumberSelectedLoadCases,
	array<String^>^% LoadCaseList
)
abstract GetLoadCasesSelectedForDisplay :
        NumberSelectedLoadCases : int byref *
        LoadCaseList : string[] byref -> int
Parameters
NumberSelectedLoadCases
Type: System.Int32
Returned Item: The number of load cases selected for table display.
LoadCaseList
Type: System.String[]
Returned Item: The zero-based list of load cases selected for table display.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
This list sets the load cases that are included when displaying analysis results.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace